In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.arange(4),index=['A','B','C','D'])
s1

A    0
B    1
C    2
D    3
dtype: int64

In [3]:
s1.drop('B') #droping entry B

A    0
C    2
D    3
dtype: int64

In [4]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['A','B','C','D'], columns=['c1','c2','c3','c4'])

In [5]:
df1

   c1  c2  c3  c4
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [6]:
df1.drop('C') #dropping row C

   c1  c2  c3  c4
A   0   1   2   3
B   4   5   6   7
D  12  13  14  15

In [7]:
df1.drop('c1',axis=1) #dropping column c1

   c2  c3  c4
A   1   2   3
B   5   6   7
C   9  10  11
D  13  14  15

In [8]:
df1.drop(['c1','c3'],axis=1) #dropping column c1 and c3

   c2  c4
A   1   3
B   5   7
C   9  11
D  13  15